posts/line-intersections-with-cross-products/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Elegant intersections using ideas from projective geometry.">
<meta name="viewport" content="width=device-width">
<title>Line Intersections with Cross Products | im_oisin</title>
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://imois.in/posts/line-intersections-with-cross-products/">
<!--[if lt IE 9]><![endif]--><link href="https://code.jquery.com/ui/1.10.2/themes/smoothness/jquery-ui.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/cookies-eu-banner.default.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/sudoku.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/font-awesome.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/bnw.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
<meta name="author" content="Oisin Carroll">
<meta property="og:site_name" content="im_oisin">
<meta property="og:title" content="Line Intersections with Cross Products">
<meta property="og:url" content="https://imois.in/posts/line-intersections-with-cross-products/">
<meta property="og:description" content="Elegant intersections using ideas from projective geometry.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2022-05-21T02:46:09+01:00">
<meta property="article:tag" content="math">
</head>
<body>

    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://imois.in/" title="im_oisin" rel="home">
                im_oisin
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../games">Games</a></li>
                <li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../pages/about-me">About Me</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Line Intersections with Cross Products
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2022-05-21T02:46:09+01:00">2022/05/21</time><!-- 
        &nbsp;&nbsp;|&nbsp;&nbsp;
        <a href="/posts/line-intersections-with-cross-products/index.org" id="sourcelink">Source</a>
-->
</div>
	  <div class="post-tags">
	    <div class="tag">
	      <a href="../../categories/math/" rel="tag">math</a>
	    </div>
	  </div>
	</div>
      </div>
    </div>


    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-org62c568d" class="outline-2">
<h2 id="org62c568d">Introduction</h2>
<div class="outline-text-2" id="text-org62c568d">
<p>
Projective Geometry is a field of mathematics most commonly used for anything to do with cameras - rendering, 3d reconstruction etc. I've only a weak knowledge of it, but this method of calculating the intersection of two lines falls out of the first chapter or two in a standard textbook. I found it very surprising, and hopefully you find it interesting, too!
</p>

<p>
First off - a demo of the code itself:
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>

<span class="k">def</span> <span class="nf">intersectLines</span><span class="p">(</span><span class="n">s1</span><span class="p">,</span> <span class="n">e1</span><span class="p">,</span> <span class="n">s2</span><span class="p">,</span> <span class="n">e2</span><span class="p">):</span>  <span class="c1"># start of line 1/ end of line 1 etc</span>
    <span class="c1"># Append 1 to all points. Make them (x, y, 1)</span>
    <span class="n">s1</span><span class="p">,</span> <span class="n">e1</span><span class="p">,</span> <span class="n">s2</span><span class="p">,</span> <span class="n">e2</span> <span class="o">=</span> <span class="p">[</span><span class="n">np</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">p</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span> <span class="k">for</span> <span class="n">p</span> <span class="ow">in</span> <span class="p">[</span><span class="n">s1</span><span class="p">,</span> <span class="n">e1</span><span class="p">,</span> <span class="n">s2</span><span class="p">,</span> <span class="n">e2</span><span class="p">]]</span>
    <span class="c1"># Solve - just cross product everything (!)</span>
    <span class="n">kx</span><span class="p">,</span> <span class="n">ky</span><span class="p">,</span> <span class="n">k</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">cross</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">cross</span><span class="p">(</span><span class="n">s1</span><span class="p">,</span> <span class="n">e1</span><span class="p">),</span> <span class="n">np</span><span class="o">.</span><span class="n">cross</span><span class="p">(</span><span class="n">s2</span><span class="p">,</span> <span class="n">e2</span><span class="p">))</span>
    <span class="k">return</span> <span class="p">([</span><span class="n">kx</span><span class="o">/</span><span class="n">k</span><span class="p">,</span> <span class="n">ky</span><span class="o">/</span><span class="n">k</span><span class="p">]</span> <span class="k">if</span> <span class="n">k</span> <span class="o">!=</span> <span class="mi">0</span> <span class="k">else</span> <span class="kc">None</span><span class="p">)</span>
</pre></div>

<p>
If you're thinking 'why does that work???', or 'where's the bit with the equations?' you're not alone! Cross products are usually only seen when trying to find orthogonal vectors. Here we're appending a 1 to some points, cross producting them twice, and somehow ending up with the intersection of the lines.
</p>

<p>
Let's start off by working out the inner cross products: <code>np.cross(s1, e1)</code> and <code>np.cross(s2, e2)</code>. Each are simply taking the product of two points which both lie along the same line.
</p>
</div>

<div id="outline-container-orge6b2ea4" class="outline-3">
<h3 id="orge6b2ea4">Points -&gt; Lines</h3>
<div class="outline-text-3" id="text-orge6b2ea4">
<p>
Here we'll show that these products calculate a line equation. Consider two points \(\vec{S}\) and \(\vec{E}\).
</p>

<p>
\[
\begin{bmatrix} S_x \\ S_y \\ 1 \end{bmatrix} \
\times \
\begin{bmatrix} E_x \\ E_y \\ 1 \end{bmatrix} \
= \
\begin{bmatrix} S_y - E_y \\ E_x - S_x \\ S_xE_y - S_yE_x \end{bmatrix} \
= \
\begin{bmatrix} a \\ b \\ c \end{bmatrix} \
\]
</p>

<p>
This first cross product actually gives the equation of the line defined by \(\vec{S}\) and \(\vec{E}\) in the form \(ax + by + c = 0\). Let's quickly verify…
</p>

\begin{align}
ax + by + c = 0 \\
(S_y - E_y)x + (E_x - S_x)y + S_xE_y - S_yE_x = 0
\end{align}
<p>
Verifying \(\vec{S}\) lies on the line \(ax + by + c = 0\):
</p>
\begin{align}
\require{cancel} (S_y - E_y)S_x + (E_x - S_x)S_y + S_xE_y - S_yE_x = 0 \\
S_xS_y - S_xE_y + S_yE_x - S_xS_y + S_xE_y - S_yE_x = 0 \\
\cancel{S_xS_y - S_xS_y} + \cancel{S_xE_y - S_xE_y} + \cancel{S_yE_x - S_yE_x} = 0 \\
0 = 0
\end{align}

<p>
Verifying \(\vec{E}\) lies on the line \(ax + by + c = 0\):
</p>
\begin{align}
(S_y - E_y)E_x + (E_x - S_x)E_y + S_xE_y - S_yE_x = 0 \\
S_yE_x - E_xE_y + E_xE_y - S_xE_y + S_xE_y - S_yE_x = 0 \\
\cancel{S_yE_x - S_yE_x} + \cancel{E_xE_y - E_xE_y} + \cancel{S_xE_y - S_xE_y} = 0 \\
0 = 0
\end{align}

<p>
Hence \(ax + by + c = 0\) is an equation of the line passing through \(\vec{S}\) and \(\vec{E}\).
</p>
</div>
</div>


<div id="outline-container-org1d25214" class="outline-3">
<h3 id="org1d25214">Lines -&gt; Intersection</h3>
<div class="outline-text-3" id="text-org1d25214">
<p>
The cross product of two line equations gives their intersection… Let's check.
</p>

<p>
Take two lines: \(a_1x + b_1y + c_1 = 0\) defined by \(\begin{bmatrix} a_1 \\ b_1 \\ c_1 \end{bmatrix}\) and \(a_2x + b_2y + c_2 = 0\) defined by \(\begin{bmatrix} a_2 \\ b_2 \\ c_2 \end{bmatrix}\).
</p>

<p>
\[
\begin{bmatrix} a_1 \\ b_1 \\ c_1 \end{bmatrix} \times \begin{bmatrix} a_2 \\ b_2 \\ c_2 \end{bmatrix} \
= \
\begin{bmatrix} b_1c_2 - c_1b_2 \\ c_1a_2 - a_1c_2 \\ a_1b_2 - b_1a_2 \end{bmatrix} \
\]
Now, convert to the \(\begin{bmatrix}x \\ y \\ 1 \end{bmatrix}\) format. This means we must divide by \(a_1b_2 - b_1a_2\). We quickly check this is non-zero.
Assuming the lines have an intersection \(\implies\) their slopes are different \(\implies\) \(\frac{a_1}{b_1} \neq \frac{a_2}{b_2} \implies \frac{a_1}{b_1} - \frac{a_2}{b_2} \neq 0 \implies a_1b_2 - b_1a_2 \neq 0\). Conversely if \(a_1b_2 - b_1a_2 = 0\) then the lines are parallel and have no intersection.
</p>

<p>
\[
\begin{bmatrix} P \\ 1 \end{bmatrix} = \begin{bmatrix} (b_1c_2 - c_1b_2)/(a_1b_2 - b_1a_2) \\ (c_1a_2 - a_1c_2)/(a_1b_2 - b_1a_2) \\ 1 \end{bmatrix} \
\]
Finally the vector \(P \in \mathbb{R}^2\) is the first values of this vector, and is the intersection of the lines! It's worth noting in projective geometry the point \((x, y, 1)\) is equilivant to \((kx, ky, k)\)
</p>

<p>
To quickly verify this:
</p>

<p>
\(P\) lies on \(a_1x + b_1y + c_1 = 0\):
</p>
\begin{align}
a_1\frac{b_1c_2 - c_1b_2}{a_1b_2 - b_1a_2} + b_1\frac{c_1a_2 - a_1c_2}{a_1b_2 - b_1a_2} + c_1 = 0 \\
a_1(b_1c_2 - c_1b_2) + b_1(c_2a_2 - a_1c_2) + c_1(a_1b_2 - b_1a_2) = 0 \\
a_1b_1c_2 - a_1c_1b_2 + b_1c_1a_2 - a_1b_1c_2 + a_1c_1b_2 - b_1c_1a_2 = 0 \\
\cancel{a_1b_1c_2 - a_1b_1c_2} + \cancel{a_1c_1b_2 - a_1c_1b_2} + \cancel{b_1c_1a_2 - b_1c_1a_2} = 0 \\
0 = 0
\end{align}
<p>
In the same way it's straightforward to show \(P\) lies on \(a_2x + b_2y + c_2 = 0\).
Hence \(P\) is an intersection of the lines (provided one exists)!
</p>
</div>
</div>

<div id="outline-container-org435c0eb" class="outline-3">
<h3 id="org435c0eb">Sample code in C#</h3>
<div class="outline-text-3" id="text-org435c0eb">
<p>
This is a handy snippet to have for Unity. It's worth noting, however, that this isn't the most numerically stable or fastest way I'm sure. I use it because it's short, neat and I don't require any higher accuracy or speed from it.
</p>

<div class="highlight"><pre><span></span><span class="kd">private</span> <span class="kd">static</span> <span class="n">bool</span> <span class="nf">TryIntersectLines</span><span class="p">(</span><span class="n">Vector2</span> <span class="n">start1</span><span class="p">,</span> <span class="n">Vector2</span> <span class="n">end1</span><span class="p">,</span> <span class="n">Vector2</span> <span class="n">start2</span><span class="p">,</span> <span class="n">Vector2</span> <span class="n">end2</span><span class="p">,</span> <span class="n">out</span> <span class="n">Vector2</span> <span class="n">intersection</span><span class="p">)</span> <span class="p">{</span>
    <span class="c1">// Append 1 to all points. (x, y) -&gt; (x, y, 1)</span>
    <span class="n">Vector3</span> <span class="nf">toProjPlane</span><span class="p">(</span><span class="n">Vector2</span> <span class="n">p</span><span class="p">)</span> <span class="o">=&gt;</span> <span class="k">new</span> <span class="n">Vector3</span><span class="p">(</span><span class="n">p</span><span class="p">.</span><span class="na">x</span><span class="p">,</span> <span class="n">p</span><span class="p">.</span><span class="na">y</span><span class="p">,</span> <span class="mi">1</span><span class="p">);</span>

    <span class="c1">// Get equations of lines using cross product &amp; solve</span>
    <span class="n">Vector3</span> <span class="n">l1</span> <span class="o">=</span> <span class="n">Vector3</span><span class="p">.</span><span class="na">Cross</span><span class="p">(</span><span class="n">toProjPlane</span><span class="p">(</span><span class="n">start1</span><span class="p">),</span> <span class="n">toProjPlane</span><span class="p">(</span><span class="n">end1</span><span class="p">));</span>
    <span class="n">Vector3</span> <span class="n">l2</span> <span class="o">=</span> <span class="n">Vector3</span><span class="p">.</span><span class="na">Cross</span><span class="p">(</span><span class="n">toProjPlane</span><span class="p">(</span><span class="n">start2</span><span class="p">),</span> <span class="n">toProjPlane</span><span class="p">(</span><span class="n">end2</span><span class="p">));</span>
    <span class="n">Vector3</span> <span class="n">sol</span> <span class="o">=</span> <span class="n">Vector3</span><span class="p">.</span><span class="na">Cross</span><span class="p">(</span><span class="n">l1</span><span class="p">,</span> <span class="n">l2</span><span class="p">);</span>

    <span class="k">if</span> <span class="p">(</span><span class="n">sol</span><span class="p">.</span><span class="na">z</span> <span class="o">==</span> <span class="mi">0</span><span class="p">)</span> <span class="p">{</span>
	<span class="c1">// No solution - result 'at infinity' in projective space.</span>
	<span class="n">intersection</span> <span class="o">=</span> <span class="k">default</span><span class="p">(</span><span class="n">Vector2</span><span class="p">);</span>
	<span class="k">return</span> <span class="kc">false</span><span class="p">;</span>
    <span class="p">}</span>
    <span class="k">else</span> <span class="p">{</span>
	<span class="n">intersection</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Vector2</span><span class="p">(</span><span class="n">sol</span><span class="p">.</span><span class="na">x</span><span class="o">/</span><span class="n">sol</span><span class="p">.</span><span class="na">z</span><span class="p">,</span> <span class="n">sol</span><span class="p">.</span><span class="na">y</span><span class="o">/</span><span class="n">sol</span><span class="p">.</span><span class="na">z</span><span class="p">);</span>
	<span class="k">return</span> <span class="kc">true</span><span class="p">;</span>  <span class="c1">//** See below!</span>
    <span class="p">}</span>
<span class="p">}</span>
</pre></div>
</div>
</div>


<div id="outline-container-orgd0cf78d" class="outline-3">
<h3 id="orgd0cf78d">A note on line <span class="underline">segments</span>
</h3>
<div class="outline-text-3" id="text-orgd0cf78d">
<p>
The previous examples only deal with the intersection of lines defined by two points on them. If you require intersection of two line <span class="underline">segments</span> defined by start and end points, you'll need an extra condition.
Checking if the intersection is bounded in x and y by the ends of each line is sufficient - e.g.
</p>

<div class="highlight"><pre><span></span><span class="c1">// return true;  // &lt;-- replace this with...</span>
<span class="c1">// Check the intersection is within the boundaries of both lines</span>
<span class="k">return</span> <span class="p">(</span>
    <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">x</span> <span class="o">&lt;</span> <span class="n">start1</span><span class="p">.</span><span class="na">x</span><span class="p">)</span> <span class="o">!=</span> <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">x</span> <span class="o">&lt;</span> <span class="n">end1</span><span class="p">.</span><span class="na">x</span><span class="p">)</span>     <span class="c1">// Bounded in x by line 1</span>
    <span class="o">&amp;&amp;</span> <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">y</span> <span class="o">&lt;</span> <span class="n">start1</span><span class="p">.</span><span class="na">y</span><span class="p">)</span> <span class="o">!=</span> <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">y</span> <span class="o">&lt;</span> <span class="n">end1</span><span class="p">.</span><span class="na">y</span><span class="p">)</span>  <span class="c1">// Bounded in y by line 1</span>
    <span class="o">&amp;&amp;</span> <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">x</span> <span class="o">&lt;</span> <span class="n">start2</span><span class="p">.</span><span class="na">x</span><span class="p">)</span> <span class="o">!=</span> <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">x</span> <span class="o">&lt;</span> <span class="n">end2</span><span class="p">.</span><span class="na">x</span><span class="p">)</span>  <span class="c1">//  ...            line 2</span>
    <span class="o">&amp;&amp;</span> <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">y</span> <span class="o">&lt;</span> <span class="n">start2</span><span class="p">.</span><span class="na">y</span><span class="p">)</span> <span class="o">!=</span> <span class="p">(</span><span class="n">intersection</span><span class="p">.</span><span class="na">y</span> <span class="o">&lt;</span> <span class="n">end2</span><span class="p">.</span><span class="na">y</span><span class="p">)</span>  <span class="c1">//  ...            line 2</span>
<span class="p">);</span>
</pre></div>
</div>
</div>
</div>
        
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha384-3lJUsx1TJHt7BA4udB5KPnDrlkO8T6J6v/op7ui0BbCjvZ9WqV4Xm6DTP6kQ/iBH" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"] ],
        displayMath: [ ['$$','$$'], ["\\[","\\]"] ],
        processEscapes: true
    },
    "HTML-CSS": {
        styles: {'.MathJax_Display': {"margin": 0}}
    }
});
</script>
</div>
    </div>

    
    <footer><div class="container">
            <div class="social">
                <div class="social-entry">
                    <a href="mailto:oisincar@gmail.com" target="_blank">
                        <i class="fa fa-envelope-o"></i>
                    </a>
                </div>


                <div class="social-entry">
                    <a href="https://github.com/oisincar" target="_blank">
                        <i class="fa fa-github"></i>
                    </a>
                </div>

                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2022         <a href="mailto:oisincar@gmail.com">Oisin Carroll</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><div id="cookies-eu-banner" style="display: none; position:fixed; bottom: 0;">
        By continuing to visit this site, you accept the use of cookies by Google Analytics and Google Adsense.
        <a href="https://imois.in/pages/privacy-policy/" id="cookies-eu-more">Read more</a>
        <button id="cookies-eu-reject">Reject</button>
        <button id="cookies-eu-accept">Accept</button>
    </div>

    
<script src="../../assets/js/cookies-eu-banner.js"></script><script>

CookiesEuBanner.prototype.setCookie = function(name, value) {
  var date = new Date();
  date.setTime(date.getTime() + this.cookieTimeout);

  document.cookie = name + '=' + value + ';expires=' + date.toGMTString() + ';path=/' + ';secure;SameSite=Lax';
}


    new CookiesEuBanner(function () {
        // Your code to launch when user accept cookies
        (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
        })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

        console.log("Enabling google analytics!");

        ga('create', 'UA-143421297-1', 'auto');
        ga('send', 'pageview');


        // TODO: Set up adsense here..??
    }, true);

</script><script src="../../assets/js/jquery-1.10.2.min.js" type="text/javascript"></script><script src="../../assets/js/headroom.min.js" type="text/javascript"></script><script src="../../assets/js/scripts.js" type="text/javascript"></script><div>
</div>
</body>
</html>
